FemDesign.Reinforcement.Straight
straight (child of surface_rf_type)

FemDesign.Reinforcement.Straight.#ctor
Parameterless constructor for serialization.

FemDesign.Reinforcement.Straight.#ctor(FemDesign.Reinforcement.ReinforcementDirection,System.Double,FemDesign.GenericClasses.Face,System.Double)
Private constructor accessed by static methods.

FemDesign.Reinforcement.Straight.#ctor(System.String,System.Double,System.String,System.Double)
Define straight reinforcement layout for surface reinforcement.
Remarks: Create
direction: "x"/"y"
space: Spacing between bars.
face: "top"/"bottom"
cover: Reinforcement concrete cover.